# типы данных
'''
a = 5 #это число
a1 = 5. #это float
b = '2' #это строка
c = str(a) #это строку
print(type(a), a, type(b), type(a1), a1, type(c), sep='\t')
'''

# f - string
'''
имя = "Анна"
возраст = 475437654
город = "Москва"

print(f"Привет, меня зовут {имя}. Мне {возраст*0} лет, и я живу в городе {город}.")'''

# Задача: вывести квадрат переменной N
'''
N = 8
print(f"число в квадрате = {N*N}")'''

# Задача2: на вход идут два числа M и N (стороны прямоугольника) нужно вывести площадь прямоугольника
'''
M = 5
N = 10
print("площадь прямоугольника = ",M*N )
'''

# Ввод данных с клавиатуры
''' 
M = int(input("Введите высоту: "))
N = int(input("Введите ширину: "))
print(f'Площадь прямоугольника MN = {M*N}')
'''

# на вход спрашиваем у пользователя возраст N, на выход выводим Привет, ваш возраст = N
'''
N = int(input("ваш возраст: "))
print(f"возраст = {N}")'''




